src/Catalogs/ФинансовыеЦели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФинансовыеЦели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СвязанныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелеваяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДостижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦелей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыЦелей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЦелей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Достигнута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ФинансовыеЦели/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Статус = Перечисления.СтатусыЦелей.Активна;
		Объект.ДатаНачала = ТекущаяДата(); 
		
	КонецЕсли; 
	
	АктуализироватьСтатусЦели(Объект);
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АктуализироватьСтатусЦели(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьЦель(Команда)
	
	Вопрос = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтмены", ЭтотОбъект);
	ПоказатьВопрос(Вопрос, "Отменить финансовую цель? Деньги останутся на связанном счёте, вы сможете перевести их вручную.", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновитьЦель(Команда)

	Вопрос = Новый ОписаниеОповещения("ПослеОтветаНаВопросВозобновления", ЭтотОбъект);
	ПоказатьВопрос(Вопрос, "Возобновить финансовую цель?.", РежимДиалогаВопрос.ДаНет);

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ПослеОтветаНаВопросОтмены(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ОтменитьЦельНаСервере();
		ОповеститьОбИзменении(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеОтветаНаВопросВозобновления(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда  
		
		ВозобновитьЦельНаСервере();
		ОповеститьОбИзменении(Объект.Ссылка); 
		
	 КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтменитьЦельНаСервере()
	
	ОбъектЦели = Объект.Ссылка.ПолучитьОбъект();
	
	Если ОБъектЦели <> Неопределено Тогда
		
		ОбъектЦели.Статус = Перечисления.СтатусыЦелей.Отменена;
		ОбъектЦели.Записать();
		ЗначениеВРеквизитФормы(ОбъектЦели, "Объект");
		УстановитьВидимостьИДоступность();
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере 
Процедура ВозобновитьЦельНаСервере()

	ОбъектЦели = Объект.Ссылка.ПолучитьОбъект();

    Если ОБъектЦели <> Неопределено Тогда
		
		ОбъектЦели.Статус = Перечисления.СтатусыЦелей.Активна;
		АктуализироватьСтатусЦели(ОбъектЦели);
		ОбъектЦели.Записать();
		ЗначениеВРеквизитФормы(ОбъектЦели, "Объект");
        УстановитьВидимостьИДоступность();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АктуализироватьСтатусЦели(ОбъектЦели)

	Если ОбъектЦели.Статус = Перечисления.СтатусыЦелей.Отменена Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектЦели.СвязанныйСчет) Тогда
		
		Остаток = ПолучитьОстатокПоСчету(ОбъектЦели.СвязанныйСчет);
		
		Если Остаток >= ОбъектЦели.ЦелеваяСумма Тогда
			ОбъектЦели.Статус = Перечисления.СтатусыЦелей.Достигнута;
		Иначе
			ОбъектЦели.Статус = Перечисления.СтатусыЦелей.Активна;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьОстатокПоСчету(Счет)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(, Кошелек = &Кошелек) КАК ОстаткиДенежныхСредствОстатки";
	Запрос.УстановитьПараметр("Кошелек", Счет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;
	КонецЕсли;
	
	Возврат 0;

КонецФункции 

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
    СтатусОтменена  = (Объект.Статус = Перечисления.СтатусыЦелей.Отменена);
	
	Элементы.ФормаОтменитьЦель.Видимость = НЕ СтатусОтменена;
    Элементы.ФормаВозобновитьЦель.Видимость = СтатусОтменена;

КонецПроцедуры


#КонецОбласти
